Tekla.Structures.Model.RadialGrid
The RadialGrid class defines a user defined (possibly magnetic) set;
radial grid has grid planes and cylindrical grid planes as children
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
RadialGrid grid = new RadialGrid();
grid.IsMagnetic = true;
bool Result = Grid.Insert();
}
}

Tekla.Structures.Model.RadialGrid.IsMagnetic
Gets or sets whether the grid is magnetic or not
Throws System.NotImplementedException: Throws on set property to true. Radial grids do not support magnetic property
Remarks: Returns always false. Property cannot be set to true since it does not support the magnetic property

Tekla.Structures.Model.RadialGrid.RadialCoordinates
The distances between the radii of the arcs

Tekla.Structures.Model.RadialGrid.AngularCoordinates
The angular coordinates of the grid lines

Tekla.Structures.Model.RadialGrid.CoordinateZ
The coordinates for the Z-axis.

Tekla.Structures.Model.RadialGrid.RadialLabels
The labels for the grid arcs.

Tekla.Structures.Model.RadialGrid.AngularLabels
The labels for the angular grid lines.

Tekla.Structures.Model.RadialGrid.LabelZ
The labels for the Z-axis.

Tekla.Structures.Model.RadialGrid.ArcStartExtension
The extension of the grid arcs at their start point.

Tekla.Structures.Model.RadialGrid.AngularLinesStartExtension
The extension of the angular grid lines at their start point.

Tekla.Structures.Model.RadialGrid.ExtensionBelowZ
The extension below the Z-axis.

Tekla.Structures.Model.RadialGrid.ArcEndExtension
The extension of the grid arcs at their end point.

Tekla.Structures.Model.RadialGrid.AngularLinesEndExtension
The extension of the angular grid lines at their end point.

Tekla.Structures.Model.RadialGrid.ExtensionAboveZ
The extension above Z-axis.

Tekla.Structures.Model.RadialGrid.Color
Gets or sets the color of the grid.

Tekla.Structures.Model.RadialGrid.#ctor
Creates a new radial grid instance. Overrides the default creation parameters by forcing the angular
coordinates to be "0.0 6*15.0"

Tekla.Structures.Model.RadialGrid.ToStruct(Tekla.Structures.ModelInternal.dotGrid_t@)
Converts the data of the grid to the struct data that is passed to Core
dotGrid: Struct to be filled